Catalogs/ТарифыЦеха.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТарифыЦеха</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолТехников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолПечатников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентТехника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПечатника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяМашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПечатныеМашины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрименения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автонаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТарифыЦеха/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ) 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Автонаименование Тогда
		Наименование = СтрШаблон("%1, %2, %3", ?(ЗначениеЗаполнено(ВидРаботы),ВидРаботы,"Тариф"), СпособРасчетаТарифа, Тариф);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Структура =Новый Структура;
	Структура.Вставить("счПечатник", КолПечатников);
	Структура.Вставить("счТехник", КолТехников);
	Структура.Вставить("СпособРасчетаТарифа", СпособРасчетаТарифа);
	Структура.Вставить("ВидРаботы"			, ВидРаботы);
	Структура.Вставить("ПечатнаяМашина"		, ПечатнаяМашина);
	Структура.Вставить("ДатаПрименения"		, ДатаПрименения);	
	Структура.Вставить("ПроцентТехника"		, ПроцентТехника);
	Структура.Вставить("ПроцентПечатника"	, ПроцентПечатника);
	Структура.Вставить("Тариф"				, Тариф);
	Структура.Вставить("СправочникТариф"	, Ссылка);
	Структура.Вставить("Комментарий"		, Комментарий);
	
	ОбщегоНазначения.ПолучитьТарифНарядаИзРегистра(Структура);
	
КонецПроцедуры

#КонецОбласти
